import data.efficiency_function as turbine_efficiency_function
from scipy import signal

def filter1(Df_all, Df_all_m):
    if((['wdir0'] in Df_all.columns.values)==False):
        Df_all['wdir0'] = Df_all['wdir'] - Df_all['yaw']
        Df_all['wdir0'] = Df_all['wdir0'].fillna(0)
        Df_all_m['wdir0','nanmean'] = Df_all_m['wdir','nanmean'] - Df_all_m['yaw','nanmean']
    else:
        Df_all['wdir0'] = Df_all['wdir0'].fillna(0)
    Df_all['wdir0'] = turbine_efficiency_function.pass_filter(Df_all['wdir0'],0.5,5,11,0.5,1,1)
    return Df_all, Df_all_m

def filter2(Df_all, Df_all_m, medfilt_num, filter1st_tao, choose_num):
    if((['wdir0'] in Df_all.columns.values)==False):
        Df_all['wdir0'] = Df_all['wdir'] - Df_all['yaw']
        Df_all['wdir0'] = Df_all['wdir0'].fillna(0)
    else:
        Df_all['wdir0'] = Df_all['wdir0'].fillna(0)
        
    Df_all['wdir0'] = turbine_efficiency_function.pass_filter(Df_all['wdirs'],filter1st_tao,medfilt_num,11,0.1,1,choose_num)
    
    return Df_all, Df_all_m

import pandas as pd
import numpy as np
#故障码
fnum = pd.Series([5, 7, 13, 21, 22, 31, 37, 92, 100, 110, 111, 120, 121, 204, 206, 207, 230, 233, 234, 236, 237, 250, 251, 260, 302, 311, 312, 313, 314, 319, 320, 414, 417, 431, 505, 506, 507, 530, 540, 541, 549, 551, 552, 554, 557, 558, 700, 701, 706, 707, 708, 709, 715, 716, 721, 722, 730, 731, 732, 734, 744, 755, 760, 934, 1023, 1157, 1200, 1201, 1213, 1239, 1303, 1304, 1305, 1330, 1331, 1332, 1334, 1337, 1338, 1339, 1340, 1401, 1413, 1517, 1521, 1522, 1523, 1524, 1525, 1526, 1531, 1532, 1533, 1534, 1535, 1536, 1585, 1595, 1715, 1730, 1832, 1902, 1940, 2036, 2038, 2136, 2295, 2296, 2430, 2434, 2435, 2436, 2437, 2439, 2450, 2451, 2452, 2453, 2454, 2455, 2456, 2468, 3003, 3008, 3010, 3012, 3019, 3021, 3023, 3024, 3025, 3026, 3300, 3301, 3302, 3303, 3304, 3305, 3306, 3307, 3308, 3309, 3310, 3311, 3312, 3313, 3314, 3315, 3316, 3317, 3318, 3319, 3320, 3321, 3322, 3323, 3324, 3325, 3326, 3327, 3328, 3329, 3330, 3331, 3332, 3333, 3334, 3335, 3336, 3337, 3338, 3339, 3340, 3341, 3342, 3343, 3344, 3345, 3346, 3347, 3348, 3349, 3350, 3351, 3352, 3353, 3354, 3355, 3356, 3357, 3358, 3359, 3360, 3361, 3364, 3365, 3366, 3367, 3368, 3369, 3370, 3372, 3373, 3501, 3600, 3601, 3602, 3603, 3604, 3605, 3606, 3607, 3608, 3609, 3610, 3611, 3612, 3613, 3614, 3615, 3621, 3622, 3623, 3624, 3629, 3630, 3631, 3632, 3633, 3634, 3635, 3636, 3637, 3659, 3660, 3661, 3665, 3666, 3667, 3669, 3670, 3671, 3672, 3673, 3674, 3678, 3679, 3680, 3682, 3683, 3684, 3688, 3689, 3690, 3703, 3708, 3709, 3710, 3715, 3716, 3717, 3721, 3722, 3723, 3726, 3800, 3801, 3802, 3803, 3804, 3805, 3806, 3807, 3808, 3809, 3810, 3811, 3812, 3813, 3814, 3815, 3816, 3817, 3818, 3819, 3820, 3821, 3822, 3823, 3825, 3826, 3827, 3828, 3901, 3902, 3903, 3904, 3905, 3906, 3907, 3908, 3909, 3910, 3911, 3921, 4000, 4001, 8888])

#故障描述
fname = pd.Series(['振动开关断开停机', '维护状态停机', '机舱/塔底手动停机', '机舱火灾停机', '机舱控制柜火灾停机', '机舱温度高停机', '机舱温度低停机', '机舱柜紧急停机', '重复电网故障', '电网电压高', '电网电压低', '电网频率高', '电网频率低', '润滑泵开关电源保护开关跳闸停机', '风速仪结冰停机', '叶片结冰停机', '风速仪故障停机', '风小于启动风速', '风小于偏航风速', '机舱外温度低停机', '机舱外温度高停机', '600s平均风速超限停机', '3s平均风速超限停机', '风向仪故障停机', '主轴转速接近开关故障停机', '主轴超速停机', '发电机超速停机', '主轴超速重复故障停机', '发电机超速重复故障停机', '发电机超速安全链断开停机', '主轴超速安全链断开停机', '刹车信号与反馈不符停机', '液压站刹车阀保护开关跳闸停机', '刹车超时停机', '发电机驱动端轴承温度高停机重复故障停机', '发电机非驱动端轴承温度髙停机重复故障停机', '齿轮箱分配器压力低持续过长停机', '发电机功率过高', '发电机绕组温度高停机', '发电机绕组温度高重复故障停机', '发电机加热器保护开关跳闸', '发电机润滑泵缺脂', '请给发电机润滑泵加脂！', '发电机电刷磨损', '发电机风扇PTC开关保护停机', '请更换发电机碳刷', '手动偏航误差高', '偏航重复故障停机', '逆时针偏航反馈故障停机', '顺时针偏航反馈故障停机', '逆时针扭缆超限停机', '顺时针扭缆超限停机', '风机正在自动解缆', '扭缆方向与扭缆角度不符停机', '偏航电机制器保护开关跳闸停机', '扭缆极限停机', '偏航传感器故障停机', '偏航软起故障', '手动偏航激活', '偏航误差大停机', '偏航电机保护开关跳闸停机', '风机正在偏航维护', '偏航传感器同时变化故障停机', '发电机风扇保护开关跳闸停机', '变流器CANOPEN通讯故障', '变桨CANOPEN通讯故障', '液压站压力低停机', '液压站油位低停机', '液压站油泵运行超时停机', '液压站油泵保护开关跳闸停机', '齿轮箱风扇电机加热带保护开关跳闸', '齿轮箱油泵电机加热带保护开关跳闸', '请给齿轮箱添加润滑油！', '齿轮油温高持续过长停机', '齿轮箱油温度高停机', '齿轮箱润滑泵保护开关跳闸停机', '齿轮箱油温累计超时故障停机', '齿轮箱高速端轴承1温度高持续过长停', '齿轮箱高速端轴承2温度高持续过长停', '齿轮箱高速端轴承1温度高停机', '齿轮箱高速端轴承2温度高停机', '变流器转矩偏差过大', '变流器故障跳闸', '两个振动传感器同时故障停机', '振动传感器IX向振动大于设定值1', '振动传感器IX向振动大于设定值2', '振动传感器IX向振动大于设定值3', '振动传感器1Y向振动大于设定值1', '振动传感器1Y向振动大于设定值2', '振动传感器1Y向振动大于设定值3', '振动传感器2X向振动大于设定值1', '振动传感器2X向振动大于设定值2', '振动传感器2X向振动大于设定值3', '振动传感器2Y向振动大于设定值1', '振动传感器2Y向振动大于设定值2', '振动传感器2Y向振动大于设定值3', '维护销子锁住', '自检超时停机', '主轴温度低停机', '偏航传感器重复故障停机', '99刹车失败', '变桨400V供电保护开关跳闸', '轴间桨叶角度不一致停机', '发电机驱动端轴承温度超限停机', '发电机非驱动端轴承温度超限停机', '塔底柜紧急停机', '主轴温度蒿停机', '主轴承温度高停机重复故障', '主电回路接触器断开停机', '主供电回路保护开关断开', '安全链断开停机', '变桨安全链断开停机', '安全链复位按键卡住停机', '安全链PLC供电开关跳闸', 'HMI手动停机', '电网调度停机', '安全链PLC心跳异常', '主控安全链输出断开', '主控断开安全链普通继电器', '主控断开安全链紧急继电器', '变流器安全链输入断开', '400V市电故障停机', '液压站压力高停机', '齿轮箱过滤器压差高停机', '齿轮箱分配器压力低停机', '齿轮箱过滤器入口压力高停机', '变桨润滑泵阻塞停机', '变桨润滑泵缺脂', '主轴润滑泵缺脂', '请给主轴润滑泵加脂！', '主轴润滑泵泵阻塞停机', '请给变桨润滑泵加脂！', '电网A瞬时过压', '电网B瞬时过压', '电网C瞬时过压', '电网电压超出高穿轮廓', '电网电压超出低穿轮廓', '电网频率过高', '电网频率过低', '电网电压相序错误', '电网电压不平衡', '定子A瞬时过压', '定子B瞬时过压', '定子C瞬时过压', '定子电压相序错误', '电机超速', '电机欠速', '电机反转', '编码器AB脉冲计数跳变', '编码器Z脉冲丢失', '预充电超时', '预充电速度异常', '反复预充电次数超限', 'Chopper故障', 'Crowbar故障', '主断路器异常', '励磁接触器异常', '定子接触器异常', '系统故障', 'UPS故障', '主控通讯故障', 'FRT穿越阶段故障', 'FRT恢复阶段故障', '预充电接触器异常', '直流母线过压', '直流母线欠压', '网侧A相瞬时过流', '网侧B相瞬时过流', '网侧C相瞬时过流', '网侧延时过流', '网侧硬件过流', '网侧电流零序故障', '网侧电流不平衡故障', '机侧A相瞬时过流', '机侧B相瞬时过流', '机侧C相瞬时过流', '机侧模块延时过流', '机侧模块硬件过流', '机侧电流零序故障', '机侧电流不平衡故障', '双馈定子延时过流', '双馈定子电流零序故障', '双馈定子电流不平衡故障', '网侧滤波电流过流故障', '网侧滤波电流不平衡故障', '起停机指令异常', '转矩指令突变', '转矩超限', '主断故障跳闸（小红点弹出）', '主控安全链故障', '定子同期超时', '状态机运行状态异常', '重复故障', '错误触发故障', '网侧模块温度过高', '网侧模块温差过大', '机侧模块温度过高', '机侧模块温差过大', '环境温度过高', '功率柜温度过高', '控制柜温度过高', 'UPS市电故障', '风机拒动', '控制器光纤模块故障停机', '轴1驱动器故障', '轴2驱动器故障', '轴3驱动器故障', '轴1驱动器通讯故障', '轴2驱动器通讯故障', '轴3驱动器通讯故障', '主控与变桨之间通讯故障', '主控断开硬件安全链', '主控首先断开硬件安全链', '变桨首先断开硬件安全链', '主控通过通讯总线给定紧急停机模式指', '轴1驱动器自主启动紧急安全顺桨', '轴2驱动器自主启动紧急安全顺桨', '轴3驱动器自主启动紧急安全顺桨', '紧急顺桨超时', '电网供电故障', '低电压穿越超时故障', '轴1直流母线回路保护熔断器故障', '轴2直流母线回路保护熔断器故障', '轴3直流母线回路保护熔断器故障', '轴1备用电源欠电压', '轴2备用电源欠电压', '轴3备用电源欠电压', '轴1备用电源过电压', '轴2备用电源过电压', '轴3备用电源过电压', '轴1驱动器内置充电器故障', '轴2驱动器内置充电器故障', '轴3驱动器内置充电器故障', '轴1控制柜内温度传感器断线故障', '轴2控制柜内温度传感器断线故障', '轴3控制柜内温度传感器断线故障', '轴1电机温度传感器断线故障', '轴2电机温度传感器断线故障', '轴3电机温度传感器断线故障', '轴1限位开关A位置角度偏差故障', '轴2限位开关A位置角度偏差故障', '轴3限位开关A位置角度偏差故障', '轴邛艮位开关B位置角度偏差故障', '轴2限位开关B位置角度偏差故障', '轴3限位开关B位置角度偏差故障', '轴1电机与桨叶编码器角度反馈偏差故', '轴2电机与桨叶编码器角度反馈偏差故', '轴3电机与桨叶编码器角度反馈偏差故', '轴1驱动器风扇故障', '轴2驱动器风扇故障', '轴3驱动器风扇故障', '轴1桨叶角度偏差故障', '轴2桨叶角度偏差故障', '轴3桨叶角度偏差故障', '高电压穿越超时故障', '脂润滑泵故障', 'MPIM交直流控制器故障', 'MPIM直流控制器故障', '轴1电机故障', '轴2电机故障', '轴3电机故障', '轴1设备故障', '轴2设备故障', '轴3设备故障', '与客户通讯故障', '软件超速', '软件持续软超', '变桨小角度超速', '变桨指令不正常', '变桨速率过低', '变桨角度过低', '额定桨角过低', '轴1轴2变桨指令误差大', '轴2轴3变桨指令误差大', '轴1轴3变桨指令误差大', '轴1跟随误差大', '轴2跟随误差大', '轴3跟随误差大', '轴1软件跟随误差大', '轴2软件跟随误差大', '轴3软件跟随误差大', '风向偏差过大', '发电机转速加速度过大', '发电机转速与主轴转速不一致', '转矩跟随误差大', '算法程序执行超时', '算法程序短时间循环周期误差大', '算法程序长时间循环周期误差大', '非线性变桨动作触发', '风向偏差过大降功率', '低风速风向偏差过大停机', '智能避振降功率', '传动链振动超限停机', '接近开关③故障', '接近开关②故障', '接近开关②③故障', '接近开关①故障', '接近开关①③故障', '联轴器打滑', '接近开关②故障且编码器故障', '接近开关①故障且编码器故障', '转速测量故障', '齿轮箱高速端2超速开关断开', '齿轮箱高速端1超速开关断开', '主轴超速（记录）', '低电压穿趙/', '手动状态激活', '编码器转速测量异常停机'])

#故障部位，系统
fsyst = pd.Series([])

fault = pd.DataFrame({'fname':fname,'fnum':fnum.astype(int),'fsyst':fsyst})
fault['fsyst'] = fault['fname']

#故障索引号， 故障码（状态码）
snum = pd.Series([])

#故障组织，厂家风机状态
sname_org = pd.Series([])

#故障码原因，监控状态
sname = pd.Series(['计划停机', '用户停机', '用户停机', '计划停机', '计划停机', '计划停机', '计划停机', '计划停机', '电网故障', '电网故障', '电网故障', '电网故障', '电网故障', '计划停机', '计划停机', '计划停机', '故障停机', '故障停机', '故障停机', '计划停机', '计划停机', '计划停机', '计划停机', '故障停机', '故障停机', '计划停机', '计划停机', '故障停机', '故障停机', '计划停机', '计划停机', '计划停机', '计划停机', '计划停机', '故障停机', '故障停机', '计划停机', '故障停机', '计划停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '计划停机', '故障停机', '用户停机', '故障停机', '故障停机', '故障停机', '计划停机', '计划停机', '故障停机', '计划停机', '计划停机', '计划停机', '故障停机', '故障停机', '用户停机', '计划停机', '计划停机', '用户停机', '故障停机', '计划停机', '故障停机', '故障停机', '计划停机', '计划停机', '计划停机', '计划停机', '故障停机', '故障停机', '故障停机', '计划停机', '计划停机', '计划停机', '故障停机', '故障停机', '故障停机', '计划停机', '计划停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '用户停机', '计划停机', '计划停机', '故障停机', '故障停机', '故障停机', '计划停机', '计划停机', '计划停机', '计划停机', '计划停机', '故障停机', '计划停机', '故障停机', '计划停机', '计划停机', '用户停机', '故障停机', '用户停机', '电网故障', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '计划停机', '计划停机', '计划停机', '计划停机', '计划停机', '故障停机', '故障停机', '故障停机', '计划停机', '故障停机', '电网故障', '电网故障', '电网故障', '电网故障', '电网故障', '电网故障', '电网故障', '电网故障', '电网故障', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '环境待命', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '计划停机', '故障停机', '故障停机', '故障停机', '故障停机', '电网故障', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '计划停机', '故障停机', '计划停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '用户停机', '计划停机'])

state = pd.DataFrame({'type_org':sname_org,'snum':snum.astype(int),'state_type':sname})

# 并网转速
Rotspd_Connect = 1074.2 
# 额定转速
Rotspd_Rate = 1755.0 
# 转矩控制系数
# 清洗数据时使用的测点是转速还是叶片转速(简写)
clear_rotspd = "rotspd"

# 最小桨距角
Pitch_Min = 0

# 并网状态
state_ = 64
#限功率状态
limpw_state = 80 #统一状态替换
#正常发电状态
stateNormal = 71

# # 合计风速
wspd = pd.Series([3. , 3.5, 4. , 4.5, 5. , 5.5, 6. , 6.5, 7. , 7.5, 8. , 8.5, 9. ,
                  9.5,10. ,10.5,11. ,11.5,12. ,12.5,13. ,13.5,14. ,14.5,15. ,15.5,16. ,
                  16.5,17. ,17.5,18. ,18.5,19. ,19.5,20. ,20.5,21. ,21.5,22. ,22.5,23. ,
                  23.5,24. ,24.5,25. ])
# # 合计功率
pwrat = pd.Series([82.9268983640725,211.668043505953,380.430463874846,578.018055610271,
                   806.258679758194,1075.72335386021,1396.87062422361,1772.39038244023,
                   2204.25905148393,2689.92574885952,3175.20934602753,3631.26338609218,
                   4019.15321346442,4342.28857348341,4591.08420339705,4774.80924338475,
                   4885.72134358665,4942.70409051099,4976.12517848215,4992.72980237122,5000,
                   5000,5000,5000,5000,5000,5000,5000,5000,5000,5000,5000,5000,5000,5000,
                   4800,4600,4400,4200,4000,3800,3600,3400,3200,3000])