
# -*- coding: utf-8 -*-
"""
Created on Thu Aug 10 17:17:41 2023

@author: itadmin
"""

import pandas as pd
fname = pd.Series(['系统正常', '发电机水冷系统压力低故障', '远程监控停机', '齿轮箱油泵电机高速保险反馈断开', 
                   '偏航停止状态下机舱位置跳变','偏航速度过高', '偏航速度过低', 
                   '全刹状态下偏航刹车压力过低', '塔基主开关处于关闭模式', '变桨系统安全链反馈断开',
                   '变桨系统紧急顺桨', '变桨润滑1堵塞警告','机舱主开关处于手动模式','塔基主开关处于手动模式',
                   '叶片1跟随错误','安全链看门狗触发','波段10加速度过大停机','齿轮箱高速轴电机侧轴承温度短时间高故障',
                   '偏航通信故障','齿轮箱油压低故障','液压站压力低故障','安全链振动过大触发','液压站系统压力超限','发电机润滑故障',
                   '变桨润滑1堵塞故障','偏航驱动错误','齿轮箱油压低警告','塔基急停按钮按下','消防系统故障','变桨系统第一级别故障触发',
                   '发电机转速超过软件设定保护值','发电机转速与风轮转速不匹配','变桨调节不合理','叶片2跟随错误','叶片3跟随错误',
                   '机舱前后方向瞬时加速度过大','振动监视器通信错误','波段3加速度过大停机','波段11加速度过大停机','主轴抱闸',
                   '变流器转矩响应不匹配','由变流器发现的故障'])

fnum = pd.Series([  0,  100, 110,  112,  124,  125,  127,  129, 180,
        33,  34,  368, 43,  44,  54,  6,  66,  81,
        123,  133,  138,  14,  162,  173, 213,  235,  293,
        3,  355, 39, 45, 47, 51, 55, 56, 64,65,71,78,82,90])

ftype = pd.Series(['其他系统', '其他系统', '其他系统', '齿轮箱',   '偏航系统', '偏航系统', 
                   '偏航系统', '偏航系统', '其他系统', '变桨系统', '变桨系统', '变桨系统',
                   '其他系统', '其他系统', '变桨系统', '其他系统', '其他系统', '齿轮箱',
                   '偏航系统', '齿轮箱',   '其他系统', '其他系统', '其他系统', '其他系统',
                   '变桨系统', '偏航系统', '齿轮箱',   '其他系统', '其他系统', '变桨系统',
                   '其他系统', '其他系统', '变桨系统', '变桨系统', '其他系统', '其他系统',
                   '其他系统', '其他系统', '其他系统', '变流器',   '变流器',   '变流器',])

fstate = pd.Series(['正常发电', '故障停机', '用户停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', 
                    '故障停机', '故障停机', '故障停机', '故障停机', '用户停机', '用户停机', '故障停机', '故障停机',
                    '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机',
                    '故障停机', '故障停机', '故障停机', '用户停机', '故障停机', '故障停机', '故障停机', '故障停机',
                    '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机', '故障停机',
                    '故障停机', '故障停机', '故障停机',])

fault = pd.DataFrame({'fname':fname,'fnum':fnum.astype(int),'type':ftype,'fstate':fstate})

'''
fault = pd.read_excel('D:/test/result/ENOS/faultyunda.xlsx')
fault.drop_duplicates('故障代码',keep='first',inplace=True)
fault['故障代码'].values
fault['故障描述'].values
fault['监控状态'].values
fault['系统'].values
'''



